{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0082\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 320, 160, 3], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "bias": true, "border_mode": "valid", "nb_filter": 24, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_1", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "bias": true, "border_mode": "valid", "nb_filter": 36, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "bias": true, "border_mode": "valid", "nb_filter": 48, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_3", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "trainable": true, "bias": true, "border_mode": "valid", "nb_filter": 64, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_4", "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "nb_col": 3}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 100, "input_dim": 7616, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "activation": "linear", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "activation": "linear", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "activation": "linear", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"trainable": true, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "name": "dense_4", "activation": "linear", "bias": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}]}