{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 320, 160, 3], "arguments": {}, "trainable": true, "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0082\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 5, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 5, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 5, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "trainable": true, "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "input_dim": 7616, "activation": "linear", "b_regularizer": null, "output_dim": 100, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "input_dim": 100, "activation": "linear", "b_regularizer": null, "output_dim": 50, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "input_dim": 50, "activation": "linear", "b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "input_dim": 10, "activation": "linear", "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}}]}