{"config": [{"config": {"output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0086\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "trainable": true, "nb_filter": 24, "activation": "linear", "bias": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "trainable": true, "nb_filter": 36, "activation": "linear", "bias": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "nb_row": 5, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "trainable": true, "nb_filter": 48, "activation": "linear", "bias": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "nb_row": 3, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "trainable": true, "nb_filter": 64, "activation": "linear", "bias": true, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 64, "b_constraint": null, "trainable": true, "bias": true, "activation": "linear", "output_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 100, "b_constraint": null, "trainable": true, "bias": true, "activation": "linear", "output_dim": 50, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 50, "b_constraint": null, "trainable": true, "bias": true, "activation": "linear", "output_dim": 10, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "input_dim": 10, "b_constraint": null, "trainable": true, "bias": true, "activation": "linear", "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}